CouncilQueueFirmStep/app/controllers/council_queues_controller.rb

    def set_council_queue
      @council_queue = CouncilQueue.find(params[:id])
---
SELECT  `council_queues`.* FROM `council_queues` WHERE `council_queues`.`id` = 0 LIMIT 1